# OLDMassStrToReal

## Description
Converts mass string to real number and returns TURE on success.

```pascal
FUNCTION OLDMassStrToReal(
				massString    : STRING;
				VAR realValue : REAL) : BOOLEAN;
```

```python

def vs.OLDMassStrToReal(massString):
    return (BOOLEAN, realValue)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|massString|STRING||
|realValue|REAL||

## Version
Availability: from Vectorworks 2018
## Category
* Truss Analysis